app/controllers/posts_controller.rb

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First post (edited)"], ["updated_at", "2015-12-09 16:09:34.949137"], ["id", 1]]