app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "admin"], ["password_digest", "$2a$10$W1wWtoVyRkurlMPis/RG9esb5rzX5hj7um3EDqwPTqySxXdHk2YVC"], ["created_at", "2015-12-09 16:22:57.334505"], ["updated_at", "2015-12-09 16:22:57.334505"]]
---
  def create
    @user = User.new(user_params)

    if @user.save